data/collected_data/mango/api/standarda4v2/j/load_read.txt
Running 60m test @ http://20.108.158.195:60/wrk2-api/home-timeline/read
  2 threads and 1000 connections
  Thread calibration: mean lat.: 1017.589ms, rate sampling interval: 4775ms
  Thread calibration: mean lat.: 1095.576ms, rate sampling interval: 5152ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    21.58m    10.09m   39.71m    61.51%
    Req/Sec   181.67     39.54   230.00     78.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   21.99m 
 75.000%   29.85m 
 90.000%   34.88m 
 99.000%   39.71m 
 99.900%   42.08m 
 99.990%   43.59m 
 99.999%   44.49m 
100.000%   44.98m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     712.703     0.000000            1         1.00
  475529.215     0.100000       130864         1.11
  711983.103     0.200000       261716         1.25
  926941.183     0.300000       392454         1.43
 1123024.895     0.400000       523399         1.67
 1319108.607     0.500000       654419         2.00
 1412431.871     0.550000       719221         2.22
 1509949.439     0.600000       784841         2.50
 1604321.279     0.650000       849933         2.86
 1695547.391     0.700000       915646         3.33
 1790967.807     0.750000       981239         4.00
 1840250.879     0.775000      1013505         4.44
 1890582.527     0.800000      1046696         5.00
 1939865.599     0.825000      1079012         5.71
 1990197.247     0.850000      1112008         6.67
 2041577.471     0.875000      1144248         8.00
 2067791.871     0.887500      1160846         8.89
 2092957.695     0.900000      1176956        10.00
 2121269.247     0.912500      1193565        11.43
 2151677.951     0.925000      1209946        13.33
 2183135.231     0.937500      1226345        16.00
 2199912.447     0.943750      1234954        17.78
 2216689.663     0.950000      1243041        20.00
 2233466.879     0.956250      1250528        22.86
 2254438.399     0.962500      1258964        26.67
 2275409.919     0.968750      1266767        32.00
 2287992.831     0.971875      1271183        35.56
 2300575.743     0.975000      1275145        40.00
 2315255.807     0.978125      1279207        45.71
 2329935.871     0.981250      1283313        53.33
 2346713.087     0.984375      1287496        64.00
 2355101.695     0.985938      1289314        71.11
 2365587.455     0.987500      1291474        80.00
 2376073.215     0.989062      1293476        91.43
 2388656.127     0.990625      1295571       106.67
 2401239.039     0.992188      1297372       128.00
 2409627.647     0.992969      1298521       142.22
 2418016.255     0.993750      1299443       160.00
 2428502.015     0.994531      1300523       182.86
 2438987.775     0.995313      1301585       213.33
 2449473.535     0.996094      1302494       256.00
 2455764.991     0.996484      1303005       284.44
 2464153.599     0.996875      1303569       320.00
 2472542.207     0.997266      1304082       365.71
 2478833.663     0.997656      1304507       426.67
 2489319.423     0.998047      1305071       512.00
 2495610.879     0.998242      1305361       568.89
 2501902.335     0.998437      1305582       640.00
 2510290.943     0.998633      1305851       731.43
 2516582.399     0.998828      1306047       853.33
 2524971.007     0.999023      1306307      1024.00
 2529165.311     0.999121      1306427      1137.78
 2535456.767     0.999219      1306565      1280.00
 2541748.223     0.999316      1306681      1462.86
 2550136.831     0.999414      1306828      1706.67
 2558525.439     0.999512      1306957      2048.00
 2562719.743     0.999561      1307012      2275.56
 2566914.047     0.999609      1307086      2560.00
 2571108.351     0.999658      1307127      2925.71
 2577399.807     0.999707      1307185      3413.33
 2583691.263     0.999756      1307250      4096.00
 2589982.719     0.999780      1307286      4551.11
 2598371.327     0.999805      1307316      5120.00
 2604662.783     0.999829      1307365      5851.43
 2608857.087     0.999854      1307388      6826.67
 2613051.391     0.999878      1307423      8192.00
 2615148.543     0.999890      1307447      9102.22
 2615148.543     0.999902      1307447     10240.00
 2619342.847     0.999915      1307465     11702.86
 2621439.999     0.999927      1307477     13653.33
 2625634.303     0.999939      1307490     16384.00
 2629828.607     0.999945      1307501     18204.44
 2631925.759     0.999951      1307505     20480.00
 2634022.911     0.999957      1307516     23405.71
 2636120.063     0.999963      1307522     27306.67
 2644508.671     0.999969      1307534     32768.00
 2644508.671     0.999973      1307534     36408.89
 2648702.975     0.999976      1307538     40960.00
 2654994.431     0.999979      1307542     46811.43
 2661285.887     0.999982      1307546     54613.33
 2665480.191     0.999985      1307550     65536.00
 2667577.343     0.999986      1307551     72817.78
 2669674.495     0.999988      1307555     81920.00
 2669674.495     0.999989      1307555     93622.86
 2673868.799     0.999991      1307557    109226.67
 2678063.103     0.999992      1307559    131072.00
 2688548.863     0.999993      1307561    145635.56
 2688548.863     0.999994      1307561    163840.00
 2690646.015     0.999995      1307563    187245.71
 2690646.015     0.999995      1307563    218453.33
 2692743.167     0.999996      1307565    262144.00
 2692743.167     0.999997      1307565    291271.11
 2692743.167     0.999997      1307565    327680.00
 2692743.167     0.999997      1307565    374491.43
 2694840.319     0.999998      1307566    436906.67
 2694840.319     0.999998      1307566    524288.00
 2694840.319     0.999998      1307566    582542.22
 2699034.623     0.999998      1307568    655360.00
 2699034.623     1.000000      1307568          inf
#[Mean    =  1294698.698, StdDeviation   =   605244.476]
#[Max     =  2696937.472, Total count    =      1307568]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1313155 requests in 60.00m, 16.27GB read
  Socket errors: connect 0, read 628, write 3870, timeout 243561
  Non-2xx or 3xx responses: 75726
Requests/sec:    364.77
Transfer/sec:      4.63MB